In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('ucsd_cds_admission_data_2005_to_2018.csv')

In [3]:
df.head()

,year,fulltime_men_applied,fulltime_women_applied,fulltime_men_admitted,fulltime_women_admitted,fulltime_men_enrolled,fulltime_women_enrolled
0,2018,"45,636","52,265","13,781","15,821","3,220","3,484"
1,2017,"41,583","46,845","13,981","16,231","2,725","2,974"
2,2016,"39,779","44,430","14,103","16,170","2,669","3,077"
3,2015,"37,009","41,047","12,748","13,761","2,711","2,581"
4,2014,"34,618","38,822","11,758","12,837","2,538","2,383"

In [8]:
columns = df.columns[1:]

In [12]:
def remove_comma(x):
    return int(x.replace(',', ''))

In [16]:
df[columns] = df[columns].applymap(remove_comma)

In [17]:
df.head()

,year,fulltime_men_applied,fulltime_women_applied,fulltime_men_admitted,fulltime_women_admitted,fulltime_men_enrolled,fulltime_women_enrolled
0,2018,45636,52265,13781,15821,3220,3484
1,2017,41583,46845,13981,16231,2725,2974
2,2016,39779,44430,14103,16170,2669,3077
3,2015,37009,41047,12748,13761,2711,2581
4,2014,34618,38822,11758,12837,2538,2383

In [18]:
df.to_csv('ucsd.csv')